TexasInstruments/c2000ware-core-sdk/driverlib/f2838x/examples/c28x_dual/nmi/nmi_ex2_sysconfig_cpu2.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "F2838x" --package "176pin" --part "F2838x_176pin" --context "CPU2" --product "C2000WARE"
 * 
 */

/**
 * Import the modules used in this configuration.
 */
const ipc = scripting.addModule("/driverlib/ipc.js");

/**
 * Write custom configuration values to the imported modules.
 */
ipc.ipcRegisterFlag = ["IPC_FLAG0","IPC_FLAG1","IPC_FLAG10","IPC_FLAG11","IPC_FLAG12","IPC_FLAG13","IPC_FLAG14","IPC_FLAG15","IPC_FLAG16","IPC_FLAG17","IPC_FLAG18","IPC_FLAG19","IPC_FLAG2","IPC_FLAG20","IPC_FLAG21","IPC_FLAG22","IPC_FLAG23","IPC_FLAG24","IPC_FLAG25","IPC_FLAG26","IPC_FLAG27","IPC_FLAG28","IPC_FLAG29","IPC_FLAG3","IPC_FLAG30","IPC_FLAG31","IPC_FLAG4","IPC_FLAG5","IPC_FLAG6","IPC_FLAG7","IPC_FLAG8","IPC_FLAG9"];
